rambros3d/simplefoc_arduino_boards/stm32/boards.txt

menu.simplefocdbg=SimpleFOC Debug
menu.pnum=Board part number

menu.dbg=Debug symbols and core logs
menu.xserial=Serial interface
menu.usb=USB interface
menu.opt=Optimize
menu.rtlib=C Runtime Library
menu.upload_method=Upload method
menu.flash=Flash Memory Size
menu.ram=RAM Size


SimpleFOC.name=SimpleFOC boards
SimpleFOC.build.core=STMicroelectronics:arduino
SimpleFOC.build.board=SimpleFOC
SimpleFOC.build.variant_h=variant_{build.board}.h
SimpleFOC.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
SimpleFOC.upload.maximum_size=0
SimpleFOC.upload.maximum_data_size=0

# Lepton v2 STM32G031 (64kB)
SimpleFOC.menu.pnum.SIMPLEFOC_LEPTONG031=Lepton v2 STM32G031 (64kB)
SimpleFOC.menu.pnum.SIMPLEFOC_LEPTONG031.upload.maximum_data_size=8192
SimpleFOC.menu.pnum.SIMPLEFOC_LEPTONG031.upload.maximum_size=65536
SimpleFOC.menu.pnum.SIMPLEFOC_LEPTONG031.build.mcu=cortex-m0plus
SimpleFOC.menu.pnum.SIMPLEFOC_LEPTONG031.build.board=SIMPLEFOC_LEPTONG031
SimpleFOC.menu.pnum.SIMPLEFOC_LEPTONG031.build.series=STM32G0xx
SimpleFOC.menu.pnum.SIMPLEFOC_LEPTONG031.build.product_line=STM32G031xx
SimpleFOC.menu.pnum.SIMPLEFOC_LEPTONG031.build.variant=SIMPLEFOC_LEPTONG031
SimpleFOC.menu.pnum.SIMPLEFOC_LEPTONG031.build.variant_h=variant_SIMPLEFOC_LEPTONG031.h
SimpleFOC.menu.pnum.SIMPLEFOC_LEPTONG031.build.cmsis_lib_gcc=arm_cortexM0l_math
SimpleFOC.menu.pnum.SIMPLEFOC_LEPTONG031.build.st_extra_flags=-D{build.product_line} {build.xSerial} {build.simplefocdbg} -D__CORTEX_SC=0
SimpleFOC.menu.pnum.SIMPLEFOC_LEPTONG031.build.flash_offset=0x0

# MicroSpora STM32G431CBU6
SimpleFOC.menu.pnum.MICROSPORA_G431=MicroSpora G431
SimpleFOC.menu.pnum.MICROSPORA_G431.upload.maximum_size=131072
SimpleFOC.menu.pnum.MICROSPORA_G431.upload.maximum_data_size=32768
SimpleFOC.menu.pnum.MICROSPORA_G431.build.mcu=cortex-m4
SimpleFOC.menu.pnum.MICROSPORA_G431.build.fpu=-mfpu=fpv4-sp-d16
SimpleFOC.menu.pnum.MICROSPORA_G431.build.float-abi=-mfloat-abi=hard
SimpleFOC.menu.pnum.MICROSPORA_G431.build.board=MICROSPORA_G431
SimpleFOC.menu.pnum.MICROSPORA_G431.build.series=STM32G4xx
SimpleFOC.menu.pnum.MICROSPORA_G431.build.product_line=STM32G431xx
SimpleFOC.menu.pnum.MICROSPORA_G431.build.variant=MICROSPORA_G431
SimpleFOC.menu.pnum.MICROSPORA_G431.build.variant_h=variant_MICROSPORA_G431.h
#SimpleFOC.menu.pnum.MICROSPORA_G431.build.cmsis_lib_gcc=arm_cortexM4l_math
SimpleFOC.menu.pnum.MICROSPORA_G431.build.st_extra_flags=-D{build.product_line} {build.xSerial} {build.simplefocdbg}
SimpleFOC.menu.pnum.MICROSPORA_G431.build.flash_offset=0x0
SimpleFOC.menu.pnum.MICROSPORA_G431.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G431.svd
SimpleFOC.menu.pnum.MICROSPORA_G431.debug.server.openocd.scripts.2=target/stm32g4x.cfg
SimpleFOC.menu.pnum.MICROSPORA_G431.vid.0=0x0483
SimpleFOC.menu.pnum.MICROSPORA_G431.pid.0=0x5740

build.simplefocdbg=
SimpleFOC.menu.simplefocdbg.none=Disabled
SimpleFOC.menu.simplefocdbg.none.build.simplefocdbg=
SimpleFOC.menu.simplefocdbg.enabled=Enabled
SimpleFOC.menu.simplefocdbg.enabled.build.simplefocdbg=-DSIMPLEFOC_STM32_DEBUG


SimpleFOC.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
SimpleFOC.menu.upload_method.swdMethod.upload.protocol=0
SimpleFOC.menu.upload_method.swdMethod.upload.options=-g
SimpleFOC.menu.upload_method.swdMethod.upload.tool=STMicroelectronics:stm32CubeProg

SimpleFOC.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
SimpleFOC.menu.upload_method.dfuMethod.upload.protocol=dfu
SimpleFOC.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
SimpleFOC.menu.upload_method.dfuMethod.upload.tool=STMicroelectronics:stm32CubeProg

SimpleFOC.menu.xserial.generic=Enabled (generic 'Serial')
SimpleFOC.menu.xserial.none=Enabled (no generic 'Serial')
SimpleFOC.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
SimpleFOC.menu.xserial.disabled=Disabled (No Serial support)
SimpleFOC.menu.xserial.disabled.build.xSerial=

SimpleFOC.menu.usb.none=None

# Optimizations
SimpleFOC.menu.opt.osstd=Smallest (-Os default)
SimpleFOC.menu.opt.oslto=Smallest (-Os) with LTO
SimpleFOC.menu.opt.oslto.build.flags.optimize=-Os -flto
SimpleFOC.menu.opt.o1std=Fast (-O1)
SimpleFOC.menu.opt.o1std.build.flags.optimize=-O1
SimpleFOC.menu.opt.o1lto=Fast (-O1) with LTO
SimpleFOC.menu.opt.o1lto.build.flags.optimize=-O1 -flto
SimpleFOC.menu.opt.o2std=Faster (-O2)
SimpleFOC.menu.opt.o2std.build.flags.optimize=-O2
SimpleFOC.menu.opt.o2lto=Faster (-O2) with LTO
SimpleFOC.menu.opt.o2lto.build.flags.optimize=-O2 -flto
SimpleFOC.menu.opt.o3std=Fastest (-O3)
SimpleFOC.menu.opt.o3std.build.flags.optimize=-O3
SimpleFOC.menu.opt.o3lto=Fastest (-O3) with LTO
SimpleFOC.menu.opt.o3lto.build.flags.optimize=-O3 -flto
SimpleFOC.menu.opt.ogstd=Debug (-Og)
SimpleFOC.menu.opt.ogstd.build.flags.optimize=-Og
SimpleFOC.menu.opt.o0std=No Optimization (-O0)
SimpleFOC.menu.opt.o0std.build.flags.optimize=-O0

# Debug information
SimpleFOC.menu.dbg.none=None
SimpleFOC.menu.dbg.enable_sym=Symbols Enabled (-g)
SimpleFOC.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
SimpleFOC.menu.dbg.enable_log=Core logs Enabled
SimpleFOC.menu.dbg.enable_log.build.flags.debug=
SimpleFOC.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
SimpleFOC.menu.dbg.enable_all.build.flags.debug=-g

# C Runtime Library
SimpleFOC.menu.rtlib.nano=Newlib Nano (default)
SimpleFOC.menu.rtlib.nanofp=Newlib Nano + Float Printf
SimpleFOC.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
SimpleFOC.menu.rtlib.nanofs=Newlib Nano + Float Scanf
SimpleFOC.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
SimpleFOC.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
SimpleFOC.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
SimpleFOC.menu.rtlib.full=Newlib Standard
SimpleFOC.menu.rtlib.full.build.flags.ldspecs=